artillery/httpbin_test1.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 24000
      arrivalRate: 5
      name: Endurance test
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: "http.response_time.p95 < 5"
      - expression: "http.response_time.max < 10"
      - expression: http.codes.200 > 0
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 600"


scenarios:
  - name: Getting a resource
    flow:
    - get:
        url: "{{ target }}get"
    - post:
        url: "{{ target }}post"
        json:
          username: "Test User"
          password: "Test Password"
        capture:
          - json: "$.json"
            as: "request_body"
          - json: "$.headers.Host"
            as: "host"